#ifndef __pageTest_h_
#define __pageTest_h_

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

// ページ状態構造体
struct pageTestStatus{
};

void pageTestStatusDispose(struct pageTestStatus *this);

// ----------------------------------------------------------------
// ページコンストラクタ

struct pageCartridge *pageTestMain(struct pageTestStatus *stat);

// ----------------------------------------------------------------
// ポップアップコンストラクタ

struct popupCartridge *popupTestTest(struct pageTestStatus *stat);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

#endif

